<?php

namespace Larabookir\Gateway\Zarinpal;
use Larabookir\Gateway\Exceptions\BankException;

class ZarinpalException extends BankException
{
    protected $errorCode;

    public function __construct($errorCode)
    {
        $this->errorCode = $errorCode;
        parent::__construct(@self::ERRORS[$errorCode], $this->errorCode);
    }

    public const ERRORS = array(
        0 => 'تراکنش با خطا مواجه شده است',
        -9 => 'خطای اعتبار سنجی',
        -10 => 'ای پی یا مرچنت كد پذیرنده صحیح نیست.',
        -11 => 'مرچنت کد فعال نیست، پذیرنده مشکل خود را به امور مشتریان زرین‌پال ارجاع دهد.',
        -12 => 'تلاش بیش از دفعات مجاز در یک بازه زمانی کوتاه به امور مشتریان زرین پال اطلاع دهید',
        -15 => 'درگاه پرداخت به حالت تعلیق در آمده است، پذیرنده مشکل خود را به امور مشتریان زرین‌پال ارجاع دهد.',
        -16 => 'سطح تایید پذیرنده پایین تر از سطح نقره ای است.',
        -17 => 'محدودیت پذیرنده در سطح آبی',
        -30 => 'پذیرنده اجازه دسترسی به سرویس تسویه اشتراکی شناور را ندارد.',
        -31 => 'حساب بانکی تسویه را به پنل اضافه کنید. مقادیر وارد شده برای تسهیم درست نیست. پذیرنده جهت استفاده از خدمات سرویس تسویه اشتراکی شناور، باید حساب بانکی معتبری به پنل کاربری خود اضافه نماید.',
        -32 => 'مبلغ وارد شده از مبلغ کل تراکنش بیشتر است.',
        -33 => 'درصدهای وارد شده صحیح نیست.',
        -34 => 'مبلغ وارد شده از مبلغ کل تراکنش بیشتر است.',
        -35 => 'تعداد افراد دریافت کننده تسهیم بیش از حد مجاز است.',
        -36 => 'حداقل مبلغ جهت تسهیم باید ۱۰۰۰۰ ریال باشد',
        -37 => 'یک یا چند شماره شبای وارد شده برای تسهیم از سمت بانک غیر فعال است.',
        -38 => 'خطا٬عدم تعریف صحیح شبا٬لطفا دقایقی دیگر تلاش کنید.',
        -39 => 'خطایی رخ داده است به امور مشتریان زرین پال اطلاع دهید',
        -40 => 'مقدار extra parameters یا expire_in نامعتبر است.',
        -50 => 'مبلغ پرداخت شده با مقدار مبلغ ارسالی در متد وریفای متفاوت است.',
        -51 => 'پرداخت ناموفق',
        -52 => 'خطای غیر منتظره‌ای رخ داده است. پذیرنده مشکل خود را به امور مشتریان زرین‌پال ارجاع دهد.',
        -53 => 'پرداخت متعلق به این مرچنت کد نیست.',
        -54 => 'اتوریتی نامعتبر است.'
    );
}
